app/views/articles/index.html.erb

<h1>Listing Articles</h1>
<p> Total number of articles: <%= Article.count %> </p>
---
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"