app/controllers/articles_controller.rb

  def showall
    @articles = Article.all
    @books = Book.all
    @inproceedings = Inproceeding.all
---
SELECT "articles".* FROM "articles"
SELECT "books".* FROM "books"
SELECT "inproceedings".* FROM "inproceedings"

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("author", "title", "journal", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "minä"], ["title", "poajsd"], ["journal", "poasd"], ["year", 1222], ["created_at", "2016-04-11 16:03:31.895728"], ["updated_at", "2016-04-11 16:03:31.895728"]]