app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "title", "publisher", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "Some"], ["title", "some"], ["publisher", "some"], ["year", 1000], ["created_at", "2016-04-19 04:33:36.335251"], ["updated_at", "2016-04-19 04:33:36.335251"]]