app/controllers/inproceedings_controller.rb

SELECT "inproceedings".* FROM "inproceedings"
---
  def index
    @inproceedings = Inproceeding.all

INSERT INTO "inproceedings" ("author", "title", "year", "booktitle", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "apsjd"], ["title", "pijasdpija"], ["year", "pijaspdij"], ["booktitle", "asd"], ["created_at", "2016-04-19 04:25:54.414115"], ["updated_at", "2016-04-19 04:25:54.414115"]]
---
  def create
    @inproceeding = Inproceeding.new(inproceeding_params)

    respond_to do |format|
      if @inproceeding.save

DELETE FROM "inproceedings" WHERE "inproceedings"."id" = ?  [["id", 1]]
---
  def destroy
    @inproceeding.destroy

SELECT  "inproceedings".* FROM "inproceedings" WHERE "inproceedings"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_inproceeding
      @inproceeding = Inproceeding.find(params[:id])